{
    "final" : {
        "scene": {
            "name": "The Entrance",
            "description": [
                "You finally reached the entrance of the dungeon. From the number of skeleton around the massive door, you guess many have tempted to reached inside.",
                "Hopefully for you, you already now how to enter and it is time for you to incant the spell",
                "The energy required is 100000100 DAI, Are you ready?, The adventure awaits"
            ],
            "scenes": [
                {
                    "name": "look Door",
                    "description": [
                        "The door is made of 2 massive panel made of what looks like some sort of metal",
                        "There is no visible locking mechanism and your heads woner how the spell works.",
                        "You trust the efficiency of magic but you always like to find an explanation beind its working"
                    ],
                    "scenes": [
                        {
                            "name": "scratch the door with your sword",
                            "description": [
                                "Just as you draw your sword, you feel some electricity in the air",
                                "the electricity intisify as you approach the blade to the door",
                                "It is probably a good idea to put your sword back"
                            ]
                        }
                    ]
                },
                {
                    "name": "look behind",
                    "description": [
                        "it has been a long way and you wonder if you ll ever see again these hills",
                        "And if you do, In how long would it be?"
                    ]
                },
                {
                    "name": "open the door",
                    "description": [
                        "Your remember the spell words and incant them",
                        "You feel the energy being drained..."
                    ],
                    "actionIndex": 0
                }
            ]
        },
        "directions": {
            "north": false,
            "east": false,
            "west": "second",
            "south": false
        }
    },
    "first" : {
        "scene": {
            "name": "Arrival",
            "description": [
                "It’s dark when you arrive at the Ethernal. Gloom had set in hours before, and not just in terms of the weather. You knew the stories about this place: an ancient labyrinth cut into the valley floor, winding for hundreds of miles, if not more. Horrors haunted the passages: the remnants of a long-dead civilization that had passed on centuries before. What had caused it’s collapse? No one knew. Sounds like a bunch of scary stories to keep people away.",
                "That’s because what people did know was what was left behind. Jewels. Gold. Magic scrolls. Ensorcelled weapons. Keep ‘em or sell ‘em: however you please! Most people did not come out when they entered the cave that you are now approaching, but those that did held enough wealth to set them up for life.",
                "That’s why you’re here, carefully pacing down the darkened path. The forest has been silent for some time: a bad sign. Life should have continued right up until dusk. There’s a reason they have stayed away, but the reason you’ve come is stronger still. Get as much loot as you can, collect as many magical items as possible, and then get out. It wouldn’t do to become yet another death, not when there’s so much money left to spend."
            ],
            "scenes": [
                {
                    "name": "look wall",
                    "description": ["the wall is white"],
                    "scenes": [
                        {
                            "name": "inspect hole",
                            "description": [
                                "as you look, you see an insect coming out",
                                "There is light other side..."
                            ]
                        }
                    ]
                },
                {
                    "name": "look ceiling",
                    "description": ["The ceiling is weird"],
                    "scenes": [
                        {
                            "name": "jump",
                            "description": ["too high"]
                        }
                    ]
                }
            ]
        },
        "directions": {
            "north":"second",
            "east": false,
            "west": false,
            "south": false
        }
    },
    "second": {
        "scene": {
            "name": "The dasdas",
            "description": [
                "Nowhere"
            ],
            "scenes": [
                {
                    "name": "look ground",
                    "description": ["the ground is green"],
                    "scenes": [
                        {
                            "name": "break",
                            "description": [
                                "Nothing happened"
                            ]
                        }
                    ]
                }
            ]
        },
        "directions": {
            "north": false,
            "east": "final",
            "west": false,
            "south": "first"
        }
    }
}